bifurcation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); 

boundaryField
{
    entrada
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  uniform 6.57e-06;
    }
    parede
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    saidas
    {
        type            fluxCorrectedVelocity;
    }
}


// ************************************************************************* //
