bifurcation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Aqui vai o modelo do fluido: Fluido Newtoniano
transportModel  Newtonian;

// Esta é a viscosidade cinemática do fluido
// Corresponde à viscosidade dinamica dividida pela massa específica
nu              [0 2 -1 0 0 0 0] 3.3e-6;

// ************************************************************************* //
